Основные_объекты_Занятие_6/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_6/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Основные_объекты_Занятие_6/src/CommonModules/ОбщийМодульНаСервереМожноВызватьСКлиента/Module.bsl
Функция ПолучитьНаименованиеОрганизации() Экспорт 

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()

Процедура ЗаполнитьКурсВалютыНаДату( Дата, КодВалюты, Курс, Кратность = 1, ФИО) Экспорт
	
	ЗаписьРегистраСведений = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	
	ЗаписьРегистраСведений.Период = Дата;
	ЗаписьРегистраСведений.Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	ЗаписьРегистраСведений.Курс = Курс;
	ЗаписьРегистраСведений.Кратность = Кратность;
	ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(ФИО, Ложь);	
	
	ЗаписьРегистраСведений.Записать();
	
КонецПроцедуры

Функция ПолучитьЧастиФИО(Знач ФИО) Экспорт

	Если ТипЗнч(ФИО) = Тип("СправочникСсылка.Сотрудники") Тогда
	
		 ФИО = ФИО.Наименование;
	
	КонецЕсли; 
	
	ФИО = СокрЛП(ФИО);
	
	// Удаляем лишние пробелы внутри ФИО:
	Пока СтрЧислоВхождений(ФИО, "  ") > 0 Цикл
		ФИО = СтрЗаменить(ФИО, "  ", " ");
	КонецЦикла; 
	
	СтруктураРезультат = Новый Структура;
	
	ФИО = СтрЗаменить(ФИО, " ", Символы.ПС);
	
	СтруктураРезультат.Вставить("Фамилия",  СтрПолучитьСтроку(ФИО, 1));
	СтруктураРезультат.Вставить("Имя",      СтрПолучитьСтроку(ФИО, 2));
	СтруктураРезультат.Вставить("Отчество", СтрПолучитьСтроку(ФИО, 3));
	
	Возврат СтруктураРезультат;
	
КонецФункции


Функция СобратьФИО(Знач Фамилия = "Кузнецов", Знач Имя, Знач Отчество) Экспорт
	
	Возврат Фамилия + " " + Имя + " " + Отчество;
	
КонецФункции


// Описание
// 
// Параметры:
// 	СсылкаНаВалюту - СправочникСсылка - Ссылка на справочник "Валюты"
// 	Дата - Дата
// Возвращаемое значение:
// 	Структура - Описание:
// * Курс - Число - 
// * Кратность - Число -
Функция ПолучитьАктуальныеДанныеПоВалюте(СсылкаНаВалюту, Дата) Экспорт

	Вернем = Новый Структура;
	Вернем.Вставить("Курс",0);
	Вернем.Вставить("Кратность",0);
	

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс,
		|	КурсыВалютСрезПоследних.Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &СсылкаНаВалюту) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("СсылкаНаВалюту", СсылкаНаВалюту);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если (ВыборкаДетальныеЗаписи.Следующий() = Истина) Тогда
		
		Вернем.Курс = ВыборкаДетальныеЗаписи.Курс;
		Вернем.Кратность = ВыборкаДетальныеЗаписи.Кратность;
		
	КонецЕсли; 

	Возврат Вернем;
	
КонецФункции // ПолучитьАктуальныеДанныеПоВалюте()


Процедура ЗаменитьОтветственного(Кого, НаКого) Экспорт 

	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = Кого Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = НаКого;
				 
				 СкладОбъект.Записать();
			 
			 КонецЕсли;
	 
	 КонецЦикла;

КонецПроцедуры
